app/controllers/drinks_controller.rb

    def index
        #will have template
        @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"

    def show
         #will have template
         @drink = Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def create
        #will save and redirect
        @drink = Drink.new(allowed_param)

        if @drink.save
---
INSERT INTO "drinks" ("name", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mahi"], ["size", "123"], ["created_at", "2020-09-08 11:53:06.495698"], ["updated_at", "2020-09-08 11:53:06.495698"]]

    def edit
         #will have template
         @drink = Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def update
         #will save and redirect
         @drink = Drink.find(params[:id])

        if @drink.update_attributes(allowed_param)
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "drinks" SET "name" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "hihihihihihi"], ["updated_at", "2020-09-08 12:21:08.043774"], ["id", 9]]

    def destroy
        #will save and redirects
        @drink = Drink.find(params[:id])

        @drink.destroy
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]